[
    {
        "_id":"aa11",
        "course_id":"01",
         "name":"Web development course",
         "img":"https://www.designveloper.com/wp-content/uploads/2022/05/what-web-development-is.webp",
          "price":"14.6",
          "teacher":"Jhankar Mahbub",
          "details":" Web development is the work involved in developing a website for the Internet (World Wide Web) or an intranet (a private network). Web development can range from developing a simple single static page of plain text to complex web applications, electronic businesses, and social network services. A more comprehensive list of tasks to which Web development commonly refers, may include Web engineering, Web design, Web content development, client liaison, client-side/server-side scripting, Web server and network security configuration, and e-commerce development."
      },
        
      {
        "_id":"bb22",
        "course_id":"02",
         "name":"Algorithms and data structures",
         "img":"http://www.mycslab.in/wp-content/uploads/2020/01/1214005f6e5f8cf0b48bc88f70dc3e7a-rimg-w2560-h1440-gmir-1024x576.jpg",
          "price":"15.6",
          "teacher":"Jhankar Mahbub",
          "details":" A data structure is a method of organizing data in a virtual system. Think of sequences of numbers, or tables of data: these are both well-defined data structures. An algorithm is a sequence of steps executed by a computer that takes an input and transforms it into a target output.Together, data structures and algorithms combine and allow programmers to build whatever computer programs they like. Deep study into data structures and algorithms ensures well-optimized and efficient code."
      },
      {
        "_id":"cc33",
        "course_id":"03",
         "name":"Databases, networks",
         "img":"https://www.syloe.com/wp-content/uploads/2022/01/image_infrastructure_informatique.png",
          "price":"16.6",
          "teacher":"Jhankar Mahbub",
          "details":" Network database management systems (Network DBMSs) are based on a network data model that allows each record to have multiple parents and multiple child records. A network database allows flexible relationship model between entities.There are several types of database management systems such as relational, network, graph, and hierarchical. The following diagram represents a network data model that shows that the Stores entity has relationship with multiple child entities and the Transactions entity has relationships with multiple parent entities. In other words, a network database model allows one parent to have multiple child record sets and each record set can be linked to multiple nodes (parents) and children."
      },
      {
        "_id":"dd44",
        "course_id":"04",
         "name":"Agile software projects",
         "img":"https://reqtest.com/wp-content/uploads/2019/02/Agile-methodology_400_resized.jpeg",
          "price":"17.6",
          "teacher":"Jhankar Mahbub",
          "details":" Agile software development also referred to simply as Agile is a type of development methodology that anticipates the need for flexibility and applies a level of pragmatism to the delivery of the finished product. Agile software development requires a cultural shift in many companies because it focuses on the clean delivery of individual pieces or parts of the software and not on the entire application. Benefits of Agile include its ability to help teams in an evolving landscape while maintaining a focus on the efficient delivery of business value. The collaborative culture facilitated by Agile also improves efficiency throughout the organization as teams work together and understand their specific roles in the process. Finally, companies using Agile software development can feel confident that they are releasing a high-quality product since testing is performed throughout development, providing the opportunity to make changes as needed and alert teams to any potential issues."
      },
      {
        "_id":"ee55",
        "course_id":"05",
         "name":"Computer security",
         "img":"https://www.digitaluppercut.com/wp-content/uploads/2018/03/network-security.jpg",
          "price":"18.6",
          "teacher":"Jhankar Mahbub",
          "details":" Computer security refers to protecting and securing computers and their related data, networks, software, hardware from unauthorized access, misuse, theft, information loss, and other security issues. The Internet has made our lives easier and has provided us with lots of advantages but it has also put our systems security at risk of being infected by a virus, of being hacked, information theft, damage to the system, and much more.Technology is growing day by day and the entire world is in its grasp. We cannot imagine even a day without electronic devices around us. With the use of this growing technology, invaders, hackers and thieves are trying to harm our computers security for monetary gains, recognition purposes, ransom demands, bullying others, invading into other businesses, organizations, etc. In order to protect our system from all these risks, computer security is important."
      },
      {
        "_id":"ff66",
        "course_id":"06",
         "name":"Data science",
         "img":"https://imageio.forbes.com/specials-images/imageserve/615a844b0e678d9d11c5fc26/0x0.jpg?format=jpg&width=1200",
          "price":"19.6",
          "teacher":"Jhankar Mahbub",
          "details":" Data science is an essential part of many industries today, given the massive amounts of data that are produced, and is one of the most debated topics in IT circles. Its popularity has grown over the years, and companies have started implementing data science techniques to grow their business and increase customer satisfaction. In this article, well learn what data science is, and how you can become a data scientist.Data science is the domain of study that deals with vast volumes of data using modern tools and techniques to find unseen patterns, derive meaningful information, and make business decisions. Data science uses complex machine learning algorithms to build predictive models."
      },
      {
        "_id":"gg77",
        "course_id":"07",
         "name":"Artificial intelligence",
         "img":"https://www.simplilearn.com/ice9/free_resources_article_thumb/Advantages_and_Disadvantages_of_artificial_intelligence.jpg",
          "price":"13.6",
          "teacher":"Jhankar Mahbub",
          "details":" Artificial intelligence (AI) refers to the simulation of human intelligence in machines that are programmed to think like humans and mimic their actions. The term may also be applied to any machine that exhibits traits associated with a human mind such as learning and problem-solving.The ideal characteristic of artificial intelligence is its ability to rationalize and take actions that have the best chance of achieving a specific goal. A subset of artificial intelligence is machine learning (ML), which refers to the concept that computer programs can automatically learn from and adapt to new data without being assisted by humans. Deep learning techniques enable this automatic learning through the absorption of huge amounts of unstructured data such as text, images, or video."
      },
      {
        "_id":"hh88",
        "course_id":"08",
         "name":"Natural language processing",
         "img":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS0ndeMOtF3W5oceh8A0DxeI3kDVAB0T-fxrUjx8BEXNg7te3UJPPYHvYMNOCoVjFyK1d0&usqp=CAU",
          "price":"12.6",
          "teacher":"Jhankar Mahbub",
          "details":" Natural language processing (NLP) refers to the branch of computer science—and more specifically, the branch of artificial intelligence or AI—concerned with giving computers the ability to understand text and spoken words in much the same way human beings can.NLP combines computational linguistics—rule-based modeling of human language—with statistical, machine learning, and deep learning models. Together, these technologies enable computers to process human language in the form of text or voice data and to understand its full meaning, complete with the speaker or writers intent and sentiment."
      }
    
]